In [1]:
import sqlite3
import pandas as pd

In [2]:
db = sqlite3.connect('School.sqlite')

In [3]:
df = pd.read_sql_query('select * from student', db)
df

   rollNo     name  age
0       1    ankit   30
1       2     aman   30
2       3    ayush   30
3       4    nidhi   28
4       5   shikha   20
5       6  shivani   30
6       7    kajal   30

In [5]:
df[df['age'] == 30]

   rollNo     name  age
0       1    ankit   30
1       2     aman   30
2       3    ayush   30
5       6  shivani   30
6       7    kajal   30

In [21]:
df = pd.DataFrame([[102, 'Ankit', 'Physics', 25000], [103, 'Shivam', 'Maths', 30000], [104, 'Shikha', 'English', 20000],
                 [105, 'Nidhi', 'Hindi', 10000]], columns = ['teacherId', 'name', 'subject', 'salary'])
df

   teacherId    name  subject  salary
0        102   Ankit  Physics   25000
1        103  Shivam    Maths   30000
2        104  Shikha  English   20000
3        105   Nidhi    Hindi   10000

In [23]:
df.to_sql('faculty', db, index=False)

4

In [25]:
df = pd.read_sql_query('select * from faculty', db)
df

   teacherId    name  subject  salary
0        102   Ankit  Physics   25000
1        103  Shivam    Maths   30000
2        104  Shikha  English   20000
3        105   Nidhi    Hindi   10000

In [26]:
df['Address'] = 'N/A'
df

   teacherId    name  subject  salary Address
0        102   Ankit  Physics   25000     N/A
1        103  Shivam    Maths   30000     N/A
2        104  Shikha  English   20000     N/A
3        105   Nidhi    Hindi   10000     N/A

In [27]:
df.to_sql('faculty', db, if_exists = 'replace', index = False)

4

In [28]:
df = pd.read_sql_query('select * from faculty', db)
df

   teacherId    name  subject  salary Address
0        102   Ankit  Physics   25000     N/A
1        103  Shivam    Maths   30000     N/A
2        104  Shikha  English   20000     N/A
3        105   Nidhi    Hindi   10000     N/A